// cityMap.ts
export const hotCityMap: Record<string, string[]> = {
  A: [
    '阿勒泰', '阿克苏', '鞍山', '安庆', '安顺', '阿拉善左', '中国澳门',
    '阿里', '阿拉善右', '阿尔山'
  ],
  B: [
    '巴中', '百色', '包头', '毕节', '北海', '北京', '北京(大', '北京(首',
    '博乐', '保山', '白城', '布尔津', '白山', '巴彦淖尔'
  ],
  C: [
    '昌都', '承德', '常德', '长春', '朝阳', '赤峰', '长治', '重庆',
    '长沙', '成都', '沧源', '常州', '池州'
  ],
  D: [
    '大同', '达州', '稻城', '丹东', '迪庆', '大连', '大理', '敦煌',
    '东营', '大庆', '德令哈'
  ],
  E: ['鄂尔多斯', '额济纳旗', '恩施', '二连浩特'],
  F: ['福州', '阜阳', '抚远', '富蕴', '佛山'],
  G: [
    '广州', '果洛', '格尔木', '广元', '固原', '中国高雄', '赣州', '贵阳', '桂林'
  ],
  H: [
    '红原', '海口', '河池', '邯郸', '黑河', '呼和浩特', '合肥', '杭州', '淮安',
    '怀化', '海拉尔', '哈密', '衡阳', '哈尔滨', '和田', '花土沟', '中国花莲',
    '霍林郭勒', '惠州', '汉中', '黄山', '呼伦贝尔', '菏泽'
  ],
  I: [
  ],
  J: [
    '中国嘉义', '景德镇', '加格达奇', '嘉峪关', '井冈山', '金昌', '九江', '荆门',
    '佳木斯', '济宁', '锦州', '建三江', '鸡西', '九寨沟', '中国金门', '揭阳',
    '济南', '荆州'
  ],
  K: [
    '库车', '康定', '喀什', '凯里', '昆明', '库尔勒', '克拉玛依'
  ],
  L: [
    '黎平', '澜沧', '龙岩', '临汾', '兰州', '丽江', '荔波', '吕梁',
    '临沧', '陇南', '六盘水', '拉萨', '洛阳', '连云港', '临沂',
    '柳州', '泸州', '林芝'
  ],
  M: [
    '芒市', '牡丹江', '中国马祖', '绵阳', '梅州', '中国马公', '满洲里', '漠河'
  ],
  N: [
    '南昌', '中国南竿', '南充', '宁波', '南京', '宁蒗', '南宁', '南阳', '南通'
  ],
  O: [
  ],
  P: ['攀枝花', '普洱'],
  Q: [
    '琼海', '秦皇岛', '祁连', '且末', '庆阳', '黔江', '泉州', '衢州',
    '齐齐哈尔', '青岛'
  ],
  R: ['日照', '日喀则', '若羌'],
  S: [
    '神农架', '莎车', '上海', '沈阳', '石河子', '石家庄', '上饶', '三明',
    '三亚', '深圳', '十堰', '邵阳', '松原'
  ],
  T: [
    '台州', '中国台中', '塔城', '腾冲', '铜仁', '通辽', '天水', '吐鲁番',
    '通化', '中国台南', '中国台北', '天津', '中国台东', '唐山', '太原'
  ],
  U: [
  ],
  V: [
  ],
  W: [
    '五大连池', '乌兰浩特', '乌兰察布', '乌鲁木齐', '潍坊', '威海', '文山',
    '温州', '乌海', '武汉', '武夷山', '无锡', '梧州', '万州', '乌拉特中',
    '巫山', '武隆', '芜湖'
  ],
  X: [
    '兴义', '夏河', '中国香港', '西双版纳', '新源', '西安', '忻州', '信阳',
    '襄阳', '西昌', '锡林浩特', '厦门', '西宁', '徐州'
  ],
  Y: [
    '延安', '银川', '伊春', '永州', '榆林', '宜宾', '运城', '宜春', '宜昌',
    '伊宁', '义乌', '营口', '延吉', '烟台', '盐城', '扬州', '玉树', '岳阳'
  ],
  Z: [
    '郑州', '张家界', '舟山', '扎兰屯', '张掖', '昭通', '湛江', '中卫',
    '张家口', '珠海', '遵义'
  ],
  亚洲: [
    '中国香港', '首尔', '中国台北', '东京', '新加坡', '中国澳门', '曼谷', '大阪',
    '胡志明市', '马尼拉', '名古屋', '吉隆坡', '釜山', '悉尼(澳大利亚)'
  ],
  欧洲: [
    '伦敦(英国)', '巴黎', '法兰克福', '莫斯科', '罗马', '阿姆斯特丹', '米兰',
    '慕尼黑', '斯德哥尔摩', '柏林', '曼彻斯特(英国)', '马德里', '苏黎世',
    '布鲁塞尔', '哥本哈根', '赫尔辛基', '维也纳', '巴塞罗那', '雅典',
    '爱丁堡', '伯明翰(英国)', '纽卡斯尔(英国)', '日内瓦', '圣彼得堡',
    '格拉斯哥', '基辅', '布达佩斯', '汉堡', '布拉格', '杜塞尔多夫'
  ],
  美洲: [
    '纽约', '洛杉矶', '旧金山', '温哥华', '芝加哥', '多伦多', '西雅图', '华盛顿',
    '波士顿', '底特律', '亚特兰大', '休斯敦', '蒙特利尔', '夏威夷', '塞班',
    '达拉斯', '明尼阿波利斯', '费城', '圣保罗(巴西)', '渥太华', '墨西哥城',
    '拉斯维加斯', '卡尔加里', '迈阿密', '丹佛', '奥兰多', '波特兰(美国)',
    '曼彻斯特(美国)', '埃德蒙顿', '布宜诺斯艾利斯', '圣何塞(美国)'
  ],
  非洲: [
    '开罗', '约翰内斯堡', '开普敦', '内罗毕', '拉各斯', '罗安达', '毛里求斯',
    '达累斯萨拉姆', '亚的斯亚贝巴', '喀土穆', '阿克拉', '阿尔及尔',
    '卡萨布兰卡', '德班', '突尼斯', '卢萨卡', '哈拉雷', '雅温得',
    '哈博罗内', '金沙萨', '马普托', '杜阿拉', '费里敦', '阿比让', '卢克索'
  ],
  大洋洲: [
    '悉尼(澳大利亚)', '墨尔本(澳大利亚)', '奥克兰(新西兰)', '布里斯班',
    '阿德莱德', '珀斯', '惠灵顿', '堪培拉', '凯恩斯', '楠迪', '黄金海岸',
    '帕皮堤', '霍巴特', '达尔文', '达尼丁'
  ]
};

export const hotCities = [
  '北京', '上海', '广州', '深圳', '成都', '杭州', '武汉', '西安', '重庆',
  '青岛', '长沙', '南京', '厦门', '昆明', '大连', '天津', '郑州', '三亚',
  '济南', '福州'
];
export const nonMainlandHotCities = [
  '中国香港', '首尔', '中国台北', '东京', '新加坡', '中国澳门', '曼谷', '大阪',
  '胡志明市', '马尼拉', '名古屋', '伦敦(英国)', '吉隆坡', '釜山', '悉尼(澳大利亚)',
  '法兰克福', '温哥华', '巴黎', '纽约', '洛杉矶', '夏威夷'
];

export enum HotChinaCity {
  /** 海南 · 三亚 */
  Sanya = 'Sanya',
  /** 广东 · 广州 */
  Guangzhou = 'Guangzhou',
  /** 湖北 · 武汉 */
  Wuhan = 'Wuhan',
  /** 江苏 · 南京 */
  Nanjing = 'Nanjing',
  /** 重庆 */
  Chongqing = 'Chongqing',
  /** 江西 · 南昌 */
  Nanchang = 'Nanchang',
  /** 新疆 · 吐鲁番 */
  Turpan = 'Turpan',
  /** 浙江 · 杭州 */
  Hangzhou = 'Hangzhou',
  /** 福建 · 福州 */
  Fuzhou = 'Fuzhou',
  /** 湖南 · 长沙 */
  Changsha = 'Changsha',
  /** 陕西 · 西安 */
  Xian = 'Xi\'an',
  /** 安徽 · 合肥 */
  Hefei = 'Hefei',
  /** 广西 · 南宁 */
  Nanning = 'Nanning'
}

export const cities = [
  // A
  '阿勒泰', '阿克苏', '鞍山', '安庆', '安顺', '阿拉善左', '中国澳门',
  '阿里', '阿拉善右', '阿尔山',

  // B
  '巴中', '百色', '包头', '毕节', '北海', '北京', '北京(大', '北京(首)',
  '博乐', '保山', '白城', '布尔津', '白山', '巴彦淖尔',

  // C
  '昌都', '承德', '常德', '长春', '朝阳', '赤峰', '长治', '重庆',
  '长沙', '成都', '沧源', '常州', '池州',

  // D
  '大同', '达州', '稻城', '丹东', '迪庆', '大连', '大理', '敦煌',
  '东营', '大庆', '德令哈',

  // E
  '鄂尔多斯', '额济纳旗', '恩施', '二连浩特',

  // F
  '福州', '阜阳', '抚远', '富蕴', '佛山',

  // G
  '广州', '果洛', '格尔木', '广元', '固原', '中国高雄', '赣州', '贵阳', '桂林',

  // H
  '红原', '海口', '河池', '邯郸', '黑河', '呼和浩特', '合肥', '杭州', '淮安',
  '怀化', '海拉尔', '哈密', '衡阳', '哈尔滨', '和田', '花土沟', '中国花莲',
  '霍林郭勒', '惠州', '汉中', '黄山', '呼伦贝尔', '菏泽',

  // J
  '中国嘉义', '景德镇', '加格达奇', '嘉峪关', '井冈山', '金昌', '九江', '荆门',
  '佳木斯', '济宁', '锦州', '建三江', '鸡西', '九寨沟', '中国金门', '揭阳',
  '济南', '荆州',

  // K
  '库车', '康定', '喀什', '凯里', '昆明', '库尔勒', '克拉玛依',

  // L
  '黎平', '澜沧', '龙岩', '临汾', '兰州', '丽江', '荔波', '吕梁',
  '临沧', '陇南', '六盘水', '拉萨', '洛阳', '连云港', '临沂',
  '柳州', '泸州', '林芝',

  // M
  '芒市', '牡丹江', '中国马祖', '绵阳', '梅州', '中国马公', '满洲里', '漠河',

  // N
  '南昌', '中国南竿', '南充', '宁波', '南京', '宁蒗', '南宁', '南阳', '南通',

  // P
  '攀枝花', '普洱',

  // Q
  '琼海', '秦皇岛', '祁连', '且末', '庆阳', '黔江', '泉州', '衢州',
  '齐齐哈尔', '青岛',

  // R
  '日照', '日喀则', '若羌',

  // S
  '神农架', '莎车', '上海', '沈阳', '石河子', '石家庄', '上饶', '三明',
  '三亚', '深圳', '十堰', '邵阳', '松原',

  // T
  '台州', '中国台中', '塔城', '腾冲', '铜仁', '通辽', '天水', '吐鲁番',
  '通化', '中国台南', '中国台北', '天津', '中国台东', '唐山', '太原',

  // W
  '五大连池', '乌兰浩特', '乌兰察布', '乌鲁木齐', '潍坊', '威海', '文山',
  '温州', '乌海', '武汉', '武夷山', '无锡', '梧州', '万州', '乌拉特中',
  '巫山', '武隆', '芜湖',

  // X
  '兴义', '夏河', '中国香港', '西双版纳', '新源', '西安', '忻州', '信阳',
  '襄阳', '西昌', '锡林浩特', '厦门', '西宁', '徐州',

  // Y
  '延安', '银川', '伊春', '永州', '榆林', '宜宾', '运城', '宜春', '宜昌',
  '伊宁', '义乌', '营口', '延吉', '烟台', '盐城', '扬州', '玉树', '岳阳',

  // Z
  '郑州', '张家界', '舟山', '扎兰屯', '张掖', '昭通', '湛江', '中卫',
  '张家口', '珠海', '遵义'
];
